"""
Напишите программу, которая вычислит значение выражения 11*2.5/3, округлив до двух знаков после запятой.
Впишите результат вычислений:
"""

print(round(11*2.5/3, 2))