"""
Напишите программу, которая вычислит половину квадрата числа Пи (pi=3.14159), округлив до целого.
Впишите результат вычислений:
"""

pi = 3.14159
print(round(pi/2, 1))
