"""
Вместо знаков ??? впишите нужный срез. Найдите оптимальное представление среза.

В качестве ответа на задание укажите только срез, который должен стоять на месте ???
(выписывать всю строку с кодом не следует). Сам срез указывайте без лишних пробелов.
"""

"""
L = ["а", "б", "в", 1, 2, 3, 4]
print (L[ ??? ])
# ["б", "в", 1]
"""

L = ["а", "б", "в", 1, 2, 3, 4]
print(L[1:4])


"""
L = ["а", "б", "в", 1, 2, 3, 4]
print (L[ ??? ])
# ["а", 1, 4]
"""
L = ["а", "б", "в", 1, 2, 3, 4]
print(L[::3])

"""
L = ["а", "б", "в", 1, 2, 3, 4]
print (L[ ??? ])
# [1, "в", "б", "а"]
"""
L = ["а", "б", "в", 1, 2, 3, 4]
print(L[3::-1])


"""
L = ["а", "б", "в", 1, 2, 3, 4]
print (L[ ??? ])
# [4, 3, 2]
"""
L = ["а", "б", "в", 1, 2, 3, 4]
print(L[:3:-1])