"""Дополните приведенный ниже код так, чтобы он вывел произведение элементов кортежа numbers."""
numbers = (2, 3, 5, 7, -11, 13, 17, 19, 23, 29, 31, -6, 41, 43, 47, 53, 59, 61, -96, 71, 1000, -1)
mult = 1

for number in numbers:
    mult *= number
print(mult)

# Второй вариант решения задачи - взято из форума
from math import prod

numbers = (2, 3, 5, 7, -11, 13, 17, 19, 23, 29, 31, -6, 41, 43, 47, 53, 59, 61, -96, 71, 1000, -1)
print(prod(numbers))

# Третий способ решения задачи - взято из форума
from functools import reduce

numbers = (2, 3, 5, 7, -11, 13, 17, 19, 23, 29, 31, -6, 41, 43, 47, 53, 59, 61, -96, 71, 1000, -1)

print(reduce(lambda a, b: a * b, numbers))
