"""
Сумма трёх чисел
Напишите программу, которая считывает три целых числа и выводит на экран их сумму.
Каждое число записано в отдельной строке.

Формат входных данных
На вход программе подаются три целых числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести сумму введённых чисел.
"""

dig_1 = int(input())
dig_2 = int(input())
dig_3 = int(input())

sum_digs = dig_1 + dig_2 + dig_3
print(sum_digs)
