"""
Напишите программу, которая выводит текст:

"Python is a great language!", said Fred. "I don't ever remember having this much fun before."
Примечание. Используйте конкатенацию строк.
"""


text_1 = '"Python is a great language!", said Fred. "I '
text_2 = "don't ever remember having this much "
text_3 = 'fun before."'

print(text_1+text_2+text_3)