"""
I like Python 🐍
Напишите программу, которая выводит на экран следующий текст:

I***like***Python
Примечание. Используйте необязательный параметр sep.
"""


print("I", "like", "Python", sep='***')
